{
    "version": "https://jsonfeed.org/version/1",
    "title": "shiberoblogs",
    "description": "",
    "home_page_url": "https://blackwakhu.github.io/shiberoblogs",
    "feed_url": "https://blackwakhu.github.io/shiberoblogs/feed.json",
    "user_comment": "",
    "icon": "https://blackwakhu.github.io/shiberoblogs/media/website/make_the_above_logo_look_futuristic_with_a_blue_background_and_a_cheetah_and_one_designed_for_a_tech_company_add_the_words_building_your_future_today_png1-2.jpg",
    "author": {
        "name": "Derrick Shibero Wakhu"
    },
    "items": [
        {
            "id": "https://blackwakhu.github.io/shiberoblogs/introduction-to-bash-script.html",
            "url": "https://blackwakhu.github.io/shiberoblogs/introduction-to-bash-script.html",
            "title": "Introduction to Bash Script",
            "summary": "One of the first thing one learns when they start using a Linux OS distribution, they learn how to use the terminal. The terminal is available in different&nbsp; operating systems. In Linux, the default is bash(Bourne Again Shell), in Mac OS it is zsh and&hellip;",
            "content_html": "\n  <p>\n    One of the first thing one learns when they start using a Linux OS distribution, they learn how to use the terminal. The terminal is available in different&nbsp; operating systems. In Linux, the default is bash(Bourne Again Shell), in Mac OS it is zsh and in Windows OS it is the Powershell. In Linux, the terminal is one of the most important things to learn. Some of the commands in the shell include:\n  </p>\n\n  <ul>\n    <li>cat - for displaying contents in a file</li><li>ls - for listing contents in directory</li><li>sudo - allows the user access root privileges</li><li>touch - creates a new file</li><li>cd - changes the directory</li><li>find - search for an item in a directory</li>\n  </ul>\n\n  <p>\n    In order to automate some commands bash allows users to create bash files. In this blog we are going to focus in bash files.&nbsp;\n  </p>\n\n  <p>\n    In order to start we create a bash file with the extension .sh. Using sudo command we are going to make the file executable by running the following command on the terminal. Replace the script-file.sh with your own file name.\n  </p>\n<pre class=\"line-numbers  language-bash\"><code>sudo chmod +x script-file.sh</code></pre>\n\n  <p>\n    When running the above file you do the following\n  </p>\n<pre class=\"line-numbers  language-bash\"><code>./script-file.sh\n</code></pre>\n\n  <p>\n    In the following we are going to focus on displaying the results, variables and functions.&nbsp;\n  </p>\n\n    <h2 id=\"displaying-results\">\n      Displaying results\n    </h2>\n\n  <p>\n    The command used here is echo. Examples include:\n  </p>\n<pre class=\"line-numbers  language-bash\"><code>echo \"Hello world\";</code></pre>\n\n    <h2 id=\"variables\">\n      Variables\n    </h2>\n\n  <p>\n    The following way is how you initialise variables and do some simple arithmetic with them:\n  </p>\n<pre class=\"line-numbers  language-bash\"><code># declaring and assigning a variable\nphrase=\"I love bash scripting\"\necho $phrase\n</code></pre>\n\n  <p>\n    Bash is not designed to do arithmetic. In order to perform such you add the <b>expr </b>function before the equation.\n  </p>\n<pre class=\"line-numbers  language-bash\"><code># declaring, assigning integer variables and doing some math\nx=1\ny=2\nz=`expr $x + $y`\necho \"$x + $y = $z\"</code></pre>\n\n    <h2 id=\"comparisons\">\n      Comparisons\n    </h2>\n\n  <p>\n    We will begin by string comparisons\n  </p>\n<pre class=\"line-numbers  language-bash\"><code>x=\"hello\"\ny=\"hello\"\n\nif [ $x=$y ]\nthen\n    echo \"x and y match\"\nelif [ $x!=$y ]\nthen \n    echo \"x and y dont match\"\nfi\n</code></pre>\n\n  <p>\n    Now integer comparisons\n  </p>\n<pre class=\"line-numbers  language-bash\"><code>x=1\ny=2\n\nif [ $x -eq $y ] #equality\nthen \n    echo \"they are both equal\"\nelif [ $x -gt $y ] # for greater than; use -lt for less than\nthen\n    echo \"$x is greater than $y\"    \nelse\n    echo \"$x is less than $y\"\nfi</code></pre>\n\n    <h2 id=\"functions\">\n      Functions\n    </h2>\n\n  <p>\n    They can be made the following way\n  </p>\n<pre class=\"line-numbers  language-bash\"><code># creating the function\nhello(){\n    echo \"hello World\"\n}\n\n# calling the function\nhello\n</code></pre>\n\n  <p>\n    Function with parameters\n  </p>\n<pre class=\"line-numbers  language-bash\"><code># creating the function\nhelloName(){\n    echo \"Hello $1\"\n}\n\nname=\"John Doe\"\n\nhelloName $name</code></pre>",
            "image": "https://blackwakhu.github.io/shiberoblogs/media/posts/3/Screenshot-From-2025-05-28-10-49-58.png",
            "author": {
                "name": "Derrick Shibero Wakhu"
            },
            "tags": [
                   "zsh",
                   "unix",
                   "terminal",
                   "bash",
                   "Programming",
                   "Linux"
            ],
            "date_published": "2025-05-28T10:45:58+03:00",
            "date_modified": "2025-05-28T11:54:38+03:00"
        },
        {
            "id": "https://blackwakhu.github.io/shiberoblogs/how-to-add-tailwind-css-to-a-vite-project.html",
            "url": "https://blackwakhu.github.io/shiberoblogs/how-to-add-tailwind-css-to-a-vite-project.html",
            "title": "How to add Tailwind CSS to a vite project",
            "summary": "Tailwind CSS is a CSS framework that utilizes classes with CSS code that only represent a singular CSS style rule.&nbsp; The main advantage of it is that it allows a higher degree of freedom to the programmer.&nbsp;This is as compared to some frameworks like bootstrap&hellip;",
            "content_html": "\n  <p>\n    Tailwind CSS is a CSS framework that utilizes classes with CSS code that only represent a singular CSS style rule.&nbsp;\n  </p>\n\n  <p>\n    The main advantage of it is that <b>it allows a higher degree of freedom to the programmer.</b>&nbsp;This is as compared to some frameworks like bootstrap that offer generic code for each element.&nbsp;The main drawback of Tailwind is the <b>use of many classes to achieve a single style </b>that could be achieved by a dedicated CSS rule. This results in large code that feel too big to debug.&nbsp;This results to HTML code that looks like the following \n  </p>\n<pre class=\"line-numbers  language-html\"><code>&lt;!doctype html&gt;\n&lt;html&gt;\n    &lt;head&gt;\n        &lt;meta charset=\"UTF-8\"&gt;  \n        &lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"&gt;  \n        &lt;link href=\"/src/styles.css\" rel=\"stylesheet\"&gt;\n    &lt;/head&gt;\n    &lt;body&gt;  \n        &lt;h1 class=\"text-3xl font-bold underline\"&gt;    \n            Hello world!  \n        &lt;/h1&gt;\n    &lt;/body&gt;\n&lt;/html&gt;\n</code></pre>\n\n    <h2 id=\"how-to-start\">\n      How to start\n    </h2>\n\n  <p>\n    The following installation will be applicable with any framework installed using vite js. This include frameworks like Laravel, SvelteKit, React, Router, Nuxt and SolidJS.&nbsp;\n  </p>\n\n  <p>\n    1. Install tailwind css in the folder containing the project\n  </p>\n<pre class=\"line-numbers  language-bash\"><code>npm install tailwindcss @tailwindcss/vite</code></pre>\n\n  <p>\n    2. Configure the vite plugin by altering the vite.config.js by adding the following\n  </p>\n<pre class=\"line-numbers  language-javascript\"><code>import tailwindcss from '@tailwindcss/vite'\nexport default defineConfig({\n    plugins: [tailwindcss()],\n})</code></pre>\n\n  <p>\n    The following is how it will look like in react project\n  </p>\n<pre class=\"line-numbers  language-javascript\"><code>import { defineConfig } from 'vite'\nimport tailwindcss from '@tailwindcss/vite'\nimport react from '@vitejs/plugin-react'\n\n\nexport default defineConfig({\n  plugins: [\n        react(), \n        tailwindcss(),\n      ],\n})\n</code></pre>\n\n  <p>\n    3. Add the following on top of the css file\n  </p>\n<pre class=\"line-numbers  language-css\"><code>@import \"tailwindcss\";</code></pre>\n\n  <p>\n    4. Start using in your project. An example in a react project\n  </p>\n<pre class=\"line-numbers  language-jsx\"><code>&lt;div&gt;\n    &lt;h2 className=\"text-xl font-semibold text-gray-800 mb-4\"&gt;\n        Dashboard\n    &lt;/h2&gt;\n&lt;/div&gt;</code></pre>\n\n  <p>\n    \n  </p>",
            "image": "https://blackwakhu.github.io/shiberoblogs/media/posts/2/Screenshot-2025-05-21-at-17-11-47-Installing-Tailwind-CSS-with-Vite-Tailwind-CSS.png",
            "author": {
                "name": "Derrick Shibero Wakhu"
            },
            "tags": [
                   "Web Development",
                   "ViteJS",
                   "TailwindCSS",
                   "Programming",
                   "JavaScript",
                   "Front-end",
                   "CSS"
            ],
            "date_published": "2025-05-21T16:59:23+03:00",
            "date_modified": "2025-05-21T18:53:20+03:00"
        },
        {
            "id": "https://blackwakhu.github.io/shiberoblogs/my-love-of-fedora-linux.html",
            "url": "https://blackwakhu.github.io/shiberoblogs/my-love-of-fedora-linux.html",
            "title": "My love of Fedora Linux",
            "summary": "The linux operating system is one of the most complicated operating system in terms of the number of distributions(distros) it has. This is as opposed to some of great competitors, Microsoft and Apple which have only Windows and Mac os respectively. For any one trying&hellip;",
            "content_html": "\n  <p>\n    The linux operating system is one of the most complicated operating system in terms of the number of distributions(distros) it has. This is as opposed to some of great competitors, Microsoft and Apple which have only Windows and Mac os respectively. For any one trying linux for the first time, it is usually hard when it comes to choosing the first one. For me it was Ubuntu. But I have evolved after doing some soul searching while distro hopping.\n  </p>\n\n  <p>\n    Fedora Linux is one of the many distros that are associated with the linux operating system. It is associated with the Red Hat family distro. This are distros that use the dnf package manager and are based on the popular Red Hat enterprise Linux that is popular with the organizations. Fedora linux follows a release schedule where each version is released twice a year. As of writing it is Fedora 42.&nbsp;\n  </p>\n\n  <p>\n    It is the distro that I currently use so I am familiar with it.&nbsp;\n  </p>\n\n    <h2 id=\"why-i-like-fedora\">\n      Why I like fedora\n    </h2>\n\n  <p>\n    Honestly speaking Fedora Linux was not my first choice when I migrated from Windows. My first distro was Ubuntu. I had a time when I was distro hopping(term used by linux enthusiasts who are constantly installing and reinstalling different distros.) I am happy to say that I have used distros such as Ubuntu, Debian, Kali linux, Linux Mint, Pop Os, Manjaro Linux and Parrot OS.\n  </p>\n\n  <p>\n    <b>The simplicity of installation as opposed to other Linux distros.</b>&nbsp;Of all the linux distros I have ever installed, fedora was the simplest one to install. I got give it to the creators. The installer is user centered. The default installer is a GUI based. It provides only the required configurations needed. When there are errors, it makes it easier to for the user to install. While the calamares installer used by most distros makes it easier to install the respective distros, nothing comes to the easiness and fewer instructions used to install the other distros.\n  </p>\n\n  <p>\n    <b>The package manager. </b>The dnf package manager is perfectly robust containing many packages for the applications that can be installed. It also allows other package managers like snap and flatpak. This drastically increases the number of applications that can be installed.&nbsp;\n  </p>\n\n  <p>\n    <b>The terminal. </b>In fedora, while I am not sure about other distros, but in fedora if any command typed on it and the corresponding application not installed but available it searches its if it is available. If available it gives you a the option to install it.&nbsp;\n  </p>\n\n  <p>\n    <b>The community. </b>The distro has a large vibrant community on the internet. For most problems where I can't get the answer to I just have to open my browser and google. Most times somebody usually has encountered the issue and fixed it.&nbsp;\n  </p>\n\n  <p>\n    <b>The project team</b>. Many distros have their release cycles. For Fedora its twice a year. For someone who once had a debian systems and is anxious, the fact that the next system upgrade is definite makes me look up for the next while taking advantage of the existing one. For debian which is currently at 12, it is actually makes me more anxious worrying when the next update will be.&nbsp;\n  </p>\n\n    <h2 id=\"why-i-dont-like-it\">\n      Why I don't like it\n    </h2>\n\n  <p>\n    <b>The politics</b>. Linux communities have a lot politics when it comes to the different distros. This is especially so damaging when starting. The point of contention with people and the red hat based distros is the commercial company of Red Hat. One of the reasons why I did not want to install it in the first place was the death of CentOs. Such overtures makes one insecure that maybe one day it may be Fedora.\n  </p>\n\n  <p>\n    <b>The windows based apps</b>. For most people, growing up we grew up in the windows ecosystem. This one affects all the linux distros. Applications such as the popular Microsoft office and visual studio, most games and proprietary software based by the adobe company cannot be used in windows. This is negative as some of this applications offer superior features and tools better than any linux based alternative can be able to offer. While applications like steam are trying to bridge that gap, I would have wished if they offered a native application for such.<br>\n  </p>\n\n    <h2 id=\"conclusion\">\n      Conclusion\n    </h2>\n\n  <p>\n    In conclusion, getting into the linux community was one of my greatest adventures in the tech world. It allowed to feel in command of what I was doing and to learn more about how systems work. Hopefully for me I got to use Fedora and hope to be using it for years to come to learn more about it.&nbsp;\n  </p>",
            "image": "https://blackwakhu.github.io/shiberoblogs/media/posts/1/Screenshot-From-2025-05-20-08-34-05.png",
            "author": {
                "name": "Derrick Shibero Wakhu"
            },
            "tags": [
                   "operating systems",
                   "Linux",
                   "Fedora Linux"
            ],
            "date_published": "2025-05-19T15:48:45+03:00",
            "date_modified": "2025-05-21T17:02:29+03:00"
        }
    ]
}
